#__________nult_heroes_bot _______ Button for  bot____________________________________________________________________________________________________________
start_new_game = {'uk':'Нова гра','ru':'Новая игра','en':'New game','pl':'Nowa gra' }
statistics = {'uk':'Статистика', 'ru':'Статистика', 'en':'Statistic','pl':'Statystyka'}
rules = {'uk':'Правила', 'ru':'Правила','en':'Rules', 'pl':'Zasady'}
error_message = {'uk':'Вибачте щось пішло не так. Ми вже працюємо над цим. Спробуйте виконати іншу дію.\n Якщо нічого не працює відправти повідомлення з текстом <b>"/start"</b> після чого натиснути <b>"Нова гра"</b>.\n Перепрошуємо за незручності'}

#__________GameProcess_________________________________________________________________________________________________________________________________________
quest = {'uk':' <i>Уважно подивіться на картинку, та спробуйте відгадати з якого це мультфільма.\n \nЩоб краще розгледіти зображеня можете тапнути по ньому.</i>'}

#________GameProcess.statistics_________________________________________________________________________________________________________________________________
answer_text = {'uk':'<i>Ваші поточні досягнення:</i>     \n'}
total_score = {'uk':'<pre>Очки:                       </pre>'}
win_games   = {'uk':'<pre>Виграні ігри:               </pre>'}
lost_games  = {'uk':'<pre>Програні ігри:              </pre>'}
level_game  = {'uk':'<pre>Рівень поточної гри:        </pre>'}
round_level = {'uk':'<pre>Раунд поточного рівня:      </pre>'}

#______GameProcess.rulles
rulles_text = {'uk':"""Вітаємо вас в нашій грі вікторині
в котрій ви повинні вгадати назву мультфільма за шматком кадра з
цього мультфільма.

Всі мультфільми в даній версії гри є повнометражними.
Якщо мультфільм є частиною франшизи то за звичай це є перша
частина цієї франшизи винятком являються мультфільми
об'єднані в одну франшизу, але вони немають спільного сюжету
чи персонажів.

На першому рівні гравець повинен вгадати фільм по цілий картинці
На другім картинка розділена на дві частини, на третім три, на
четвертім чотири і так далі аж до шістнадцятого рівня.

Кожне завдання можна вирішити за певну кількість спроб - раундів.
Лічба раундів для кожного рівня дорівнює рівню.
Раунди нумеруються з нуля тобто перший раунд буде мати 0 а
шістнадцятий 15. В кожнім раунді гравцеві буде показуватись
шматок картинки котрий небув показаний раніше.
На першім рівні картинка ціла тому його треба пройти за один раунд.
На шістнадцятім картинка порізана на шістнадцять частин тому його
можна пройти за 16 раундів. Слідуючий раунд починається після
натиснення на кнопку "Показати ще кусок картинки"

Очки на рховуються слідуючим способом. за  кожен рівень нараховуються
кількість очок котра дорівнює рівню мінус раунд на котрому було вгадано
мультфільм

Гра триває доти поки гравець не помилиться. Або не пройде 16 рівнів
Якщо гравець помилився це програш.

Кнопка "Нова Гра" обнуляє результати поточної ігрової сесії та починає
нову гру

Кнопка "Статистика" виводить ваші ігрові досягнення

Решта кнопок для вибору подальших дій.

Натисніть кнопку "Далі" щоб продовжити"""}

#_____________________GameProcess.next_round______________________________________________________________________________

last_round = {'uk':"<i>Це була остання підказка для цього рівня.\nТепер ти маєш дати відповідь.</i>"}

not_curent_game = {'uk':'Зараз немає ні одної запущеної гри натисніть нова гра щоб розпочати'}

first_level = {'uk':"На першому рівні показано цілий кадр тому тобі непотрібні підказки"}

#_____________________GameProcess.no_correct_answer_________________________________________________________________________
answer_is_bad = {'uk':'<i>Нажаль це неправильна відповідь.\n Правильний варіант це:  </i>' }
your_scores = {'uk':'<i>\nОсь твої результати: </i>'}
press_new_game_to_start = {'uk':'<i>\nДля того щоб почати нову гру натисніть на кнопку <b>"Нова гра"</b>.</i>'}

#_____________________GameProcess.continue_game______________________________________________________________________________
continue_if_not_current_game = {'uk':'<i>У вас немає запущеної ігрової сесії.\nДля початку гри натисніть <b>"Нова гра"</b>.</i>'}

#_____________________GameProcess.reply_to_start_message_____________________________________________________________________
reply_to_start = {'uk':'<i>Вітаю, мене звуть МультБот і я хочу заграти з тобою в цікаву, гру в котрій необхідно вгадувати назви мультфільмів за шматочками кадрів.\nЯкщо ти теж не проти зіграти зі мною, то натисни <b>"Нова гра"</b>.\n Натисни <b>"Правила"</b> щоб дізнатися як грати.</i>'}

#_____________________GameProcess.confirmation_of_correct_answer

messages_begining_one = {'uk':'<i>Так ти правий</i> '}
messages_begining_thwo = {'uk':'<i> це правильна відповідь, я знаю багато цікавого про цей фільм і можу тобі розповісти. Ось наприклад ти знав що,\n </i>'}
messages_end = {'uk' : '<i>\nДля продовження натисни <b>"Далі"</b>.</i>'}

#____________________GameProcess.your_win_messages__________________________________________________________________________________________
your_win_message_text = {'uk':'Це вражаюче. Ти переміг. Можеш рахувати себе експертом в мудьтиплікації'}

#___________________GameProcess.command_is_not______________________________________________________________________________________________
this_command_is_not = {'uk':'Я не знаю такої команди для зручності використовуйте вбудовану ігрову клавіатуру'}


#_________________Keyboards___________________________________________________________________________________________________________________
further_key = {'uk':['Далі']}
continue_ = {'uk':['Продовжити']}
expose_the_next_item = {'uk':['Показати ще кусок картинки']}
